luc-github/ESP3D/esp8266/webinterface.cpp
/* 
  webinterface.cpp - esp8266 configuration class

  Copyright (c) 2014 Luc Lebosse. All rights reserved.
 
  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#include <pgmspace.h>
#include "config.h"
#include "webinterface.h"
#include "wifi.h"
#include <WiFiClient.h>
#include <WiFiServer.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
extern "C" {
#include "user_interface.h"
}

#ifdef SSDP_FEATURE
#include <ESP8266SSDP.h>
#endif
const char CSS_START[] PROGMEM ="<style>\n";
const char CSS_1[] PROGMEM ="html{font-family:sans-serif;-ms-text-size-adjust:100%;-webkit-text-size-adjust:100%; font-size:10px;}\n";
const char CSS_2[] PROGMEM ="body{font-family:\"Helvetica Neue\",Helvetica,Arial,sans-serif;font-size:14px;line-height:1.42857143;color:#333333;background-color:#ffffff;}\n";
const char CSS_3[] PROGMEM =".container{margin-right:auto;margin-left:auto;padding-left:15px;padding-right:15px;}\n";
const char CSS_4[] PROGMEM ="table{width:100%;border:0px;border-spacing:0;max-width:100%;margin-bottom:20px;}\n";
const char CSS_5[] PROGMEM =".table-bordered{border:1px solid #dddddd;}\n";
const char CSS_6[] PROGMEM ="td{white-space:nowrap; padding:2mm;}\n";
const char CSS_7[] PROGMEM ="th{text-align:left;}\n";
const char CSS_8[] PROGMEM =".table>thead>tr>th,.table>tbody>tr>th,.table>thead>tr>td,.table>tbody>tr>td{padding:8px;line-height:1.42857143;vertical-align:top;border-top:1px solid #dddddd;}\n";
const char CSS_9[] PROGMEM =".table-bordered>thead>tr>th,.table-bordered>tbody>tr>th,.table-bordered>thead>tr>td,.table-bordered>tbody>tr>td{border:1px solid #dddddd;}\n";
const char CSS_10[] PROGMEM =".table-bordered>thead>tr>th,.table-bordered>thead>tr>td{border-bottom-width:2px;}\n";
const char CSS_11[] PROGMEM =".table-striped>tbody>tr:nth-of-type(odd){background-color:#f9f9f9;}\n";
const char CSS_12[] PROGMEM ="@media (min-width:768px){.container{width:750px;}}\n";
const char CSS_13[] PROGMEM ="@media (min-width:992px){.container{width:970px;}}\n";
const char CSS_14[] PROGMEM ="@media (min-width:1200px){.container{width:1170px;}}\n";
const char CSS_15[] PROGMEM =".nav{color:#cccccc;padding-left:10;padding-right:10;list-style:none;background-color:#333333;border-radius:6px ;}\n";
const char CSS_16[] PROGMEM ="a{position:relative;display:block;padding:10px 15px;text-decoration:none;color:#cccccc;}\n";
const char CSS_17[] PROGMEM =" .active{color:#ffffff;background-color:#000000;}\n";
const char CSS_18[] PROGMEM =".active a,a:hover,a:focus{color:#FFFFFF;}\n";
const char CSS_19[] PROGMEM =".panel{margin-bottom:20px;background-color:#ffffff;border:1px solid #dddddd;border-radius:4px;-webkit-box-shadow:0 1px 1px rgba(0,0,0,0.05);box-shadow:0 1px 1px rgba(0,0,0,0.05);}\n";
const char CSS_20[] PROGMEM =".panel-body{padding:15px;}\n";
const char CSS_21[] PROGMEM =".panel-heading{padding:10px 15px;color:#333333;background-color:#f5f5f5;border-color:#dddddd;border-top-right-radius:3px;border-top-left-radius:3px;border-bottom:1px solid #dddddd;}\n";
const char CSS_22[] PROGMEM ="label{display:inline-block;max-width:100%;margin-bottom:5px;font-weight:bold;}\n";
const char CSS_23[] PROGMEM =".text-info{color:#31708f;}\n";
const char CSS_24_1[] PROGMEM =".form-control{display:block;width:auto;height:34px;padding:6px 12px;font-size:14px;line-height:1.42857143;color:#555555;background-color:#ffffff;background-image:none;";
const char CSS_24_2[] PROGMEM ="border:1px solid #cccccc;border-radius:4px;-webkit-box-shadow:inset 0 1px 1px rgba(0,0,0,0.075);box-shadow:inset 0 1px 1px rgba(0,0,0,0.075);-webkit-transition:border-color ease-in-out .15s,-webkit-box-shadow ease-in-out .15s;";
const char CSS_24_3[] PROGMEM ="-o-transition:border-color ease-in-out .15s,box-shadow ease-in-out .15s;transition:border-color ease-in-out .15s,box-shadow ease-in-out .15s;}";
const char CSS_25[] PROGMEM =".form-control:focus{border-color:#66afe9;outline:0;-webkit-box-shadow:inset 0 1px 1px rgba(0,0,0,.075),0 0 8px rgba(102,175,233,0.6);box-shadow:inset 0 1px 1px rgba(0,0,0,.075),0 0 8px rgba(102,175,233,0.6);}\n";
const char CSS_26[] PROGMEM =".form-group{margin-bottom:15px;}\n";
const char CSS_27_1[] PROGMEM =".btn{display:inline-block;margin-bottom:0;font-weight:normal;text-align:center;vertical-align:middle;-ms-touch-action:manipulation;  touch-action:manipulation;cursor:pointer;background-image:none;border:1px solid transparent;";
const char CSS_27_2[] PROGMEM ="white-space:nowrap;padding:6px 12px;font-size:14px;line-height:1.42857143;border-radius:4px;-webkit-user-select:none;-moz-user-select:none;-ms-user-select:none;user-select:none;}\n";

const char CSS_28[] PROGMEM =".btn-primary{color:#ffffff;background-color:#337ab7;border-color:#2e6da4;}\n";
const char CSS_29[] PROGMEM =".btn-primary:focus,.btn-primary:active,.btn-primary:hover,.btn-primary.focus,.btn-primary.active,.btn-primary.hover{color:#ffffff;background-color:#286090;border-color:#122b40;}\n";
const char CSS_30[] PROGMEM ="caption{padding-top:8px;padding-bottom:8px;color:#777777;text-align:left;}\n";
const char CSS_31[] PROGMEM =".alert{padding:15px;margin-bottom:20px;border:1px solid transparent;border-radius:4px;}\n";
const char CSS_32[] PROGMEM =".alert-success{background-color:#dff0d8;border-color:#d6e9c6;color:#3c763d;}\n";
const char CSS_33[] PROGMEM =".alert-danger{background-color:#f2dede;border-color:#ebccd1;color:#a94442;}\n";
const char CSS_34[] PROGMEM =".has-error .form-control{border-color:#a94442;-webkit-box-shadow:inset 0 1px 1px rgba(0,0,0,0.075);box-shadow:inset 0 1px 1px rgba(0,0,0,0.075);}\n";
const char CSS_35[] PROGMEM =".has-error .form-control:focus{border-color:#843534;-webkit-box-shadow:inset 0 1px 1px rgba(0,0,0,0.075),0 0 6px #ce8483;box-shadow:inset 0 1px 1px rgba(0,0,0,0.075),0 0 6px #ce8483;}\n";
const char CSS_36[] PROGMEM =".has-error .control-label{color:#a94442;}\n";
const char CSS_END[] PROGMEM ="</style>\n";
const char  PAGE_HEAD_1[] PROGMEM =  "<html lang=\"en\">\n<head>\n<meta charset=\"utf-8\">\n<meta http-equiv=\"X-UA-Compatible\" content=\"IE=edge\">\n" \
                                      "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1\">\n";
const char  PAGE_HEAD_2[] PROGMEM = "<title>Wifi Configuration</title>" \
                                      " </head>\n<body>\n<div class=\"container\">";
                                      
