luc-github/ESP3D/esp8266/webinterface.cpp
  }
  else
	{
	if (!CONFIG::read_buffer(EP_BAUD_RATE,  (byte *)&ibaud , INTEGER_LENGH))ibaud=DEFAULT_BAUD_RATE;
	if (!CONFIG::read_byte(EP_SLEEP_MODE, &bsleepmode ))bsleepmode=DEFAULT_SLEEP_MODE;
	if (!CONFIG::read_buffer(EP_WEB_PORT,  (byte *)&iweb_port , INTEGER_LENGH))ibaud=DEFAULT_WEB_PORT;
	if (!CONFIG::read_buffer(EP_DATA_PORT,  (byte *)&idata_port , INTEGER_LENGH))ibaud=DEFAULT_DATA_PORT;
	if (!CONFIG::read_byte(EP_POLLING_TIME, &polling_time ))polling_time=DEFAULT_POLLING_TIME;
	}
  if (wifi_get_opmode()==WIFI_STA ) stmp=wifi_config.ip2str(WiFi.localIP());
  else stmp=wifi_config.ip2str(WiFi.softAPIP());
  if (wifi_config.iweb_port!=80)
	{
		stmp+=":";
		stmp+=String(wifi_config.iweb_port);
	}
  buffer2send+=(PROGMEM2CHAR(PAGE_HEAD_1));
  add_css (buffer2send);
  buffer2send+=(PROGMEM2CHAR(PAGE_HEAD_2));
  TOPBAR(stmp.c_str(),2)
  buffer2send+=(PROGMEM2CHAR(PANEL_TOP));
  buffer2send+=(PROGMEM2CHAR(TITLE_SYSTEM));
  buffer2send+=(PROGMEM2CHAR(PANEL_START));
  buffer2send+=(PROGMEM2CHAR(FORM_START));
  //baud rate
  SELECT_START(PROGMEM2CHAR(AP_1_ID),PROGMEM2CHAR(BAUD_RATE_NAME),PROGMEM2CHAR(BAUD_RATE_ID))
  if (ibaud==9600)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(PROGMEM2CHAR(VALUE_9600), stmp.c_str(),PROGMEM2CHAR(VALUE_9600))
   if (ibaud==19200)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(PROGMEM2CHAR(VALUE_19200), stmp.c_str(),PROGMEM2CHAR(VALUE_19200))
   if (ibaud==38400)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(PROGMEM2CHAR(VALUE_38400), stmp.c_str(),PROGMEM2CHAR(VALUE_38400))
   if (ibaud==57600)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(PROGMEM2CHAR(VALUE_57600), stmp.c_str(),PROGMEM2CHAR(VALUE_57600))
   if (ibaud==115200)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(PROGMEM2CHAR(VALUE_115200), stmp.c_str(),PROGMEM2CHAR(VALUE_115200))
   if (ibaud==230400)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(PROGMEM2CHAR(VALUE_230400), stmp.c_str(),PROGMEM2CHAR(VALUE_230400))
  if (ibaud==250000)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(PROGMEM2CHAR(VALUE_250000), stmp.c_str(),PROGMEM2CHAR(VALUE_250000))
  SELECT_END
   
 // buffer2send+=(PROGMEM2CHAR(BR)); 
  
  //sleep mode
  SELECT_START(PROGMEM2CHAR(AP_2_ID),PROGMEM2CHAR(SLEEP_MODE_NAME),PROGMEM2CHAR(SLEEP_MODE_ID))
  if (bsleepmode==NONE_SLEEP_T)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(NONE_SLEEP_T).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_NONE))
  if (bsleepmode==LIGHT_SLEEP_T)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(LIGHT_SLEEP_T).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_LIGHT))
  if (bsleepmode==MODEM_SLEEP_T)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(MODEM_SLEEP_T).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_MODEM))
  SELECT_END
  
  //web port
  if(error_display[2]==0)
    {
		INPUT_TEXT( PROGMEM2CHAR(AP_3_ID),PROGMEM2CHAR(WEB_PORT_TITLE), PROGMEM2CHAR(WEB_PORT_ID),PROGMEM2CHAR(PORT_DESC),String(iweb_port).c_str())
	}
   else
	{
		INPUT_TEXT_ERROR( PROGMEM2CHAR(AP_3_ID),PROGMEM2CHAR(WEB_PORT_TITLE), PROGMEM2CHAR(WEB_PORT_ID),PROGMEM2CHAR(PORT_DESC),String(iweb_port).c_str())
	}
  //data port
  if(error_display[3]==0)
    {
		INPUT_TEXT( PROGMEM2CHAR(AP_4_ID),PROGMEM2CHAR(DATA_PORT_TITLE), PROGMEM2CHAR(DATA_PORT_ID),PROGMEM2CHAR(PORT_DESC),String(idata_port).c_str())
	}
   else
	{
		INPUT_TEXT_ERROR( PROGMEM2CHAR(AP_4_ID),PROGMEM2CHAR(DATA_PORT_TITLE), PROGMEM2CHAR(DATA_PORT_ID),PROGMEM2CHAR(PORT_DESC),String(idata_port).c_str())
	}
	
  //polling
  SELECT_START(PROGMEM2CHAR(AP_10_ID),PROGMEM2CHAR(POLLING_TITLE),PROGMEM2CHAR(POLLING_ID))
  if (polling_time==1)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(PROGMEM2CHAR(VALUE_1), stmp.c_str(),PROGMEM2CHAR(VALUE_1))
   if (polling_time==2)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(PROGMEM2CHAR(VALUE_2), stmp.c_str(),PROGMEM2CHAR(VALUE_2))
   if (polling_time==3)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(PROGMEM2CHAR(VALUE_3), stmp.c_str(),PROGMEM2CHAR(VALUE_3))
   if (polling_time==4)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(PROGMEM2CHAR(VALUE_4), stmp.c_str(),PROGMEM2CHAR(VALUE_4))
   if (polling_time==5)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(PROGMEM2CHAR(VALUE_5), stmp.c_str(),PROGMEM2CHAR(VALUE_5))
   if (polling_time==10)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(PROGMEM2CHAR(VALUE_10), stmp.c_str(),PROGMEM2CHAR(VALUE_10))
   if (polling_time==30)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(PROGMEM2CHAR(VALUE_30), stmp.c_str(),PROGMEM2CHAR(VALUE_30))
   if (polling_time==60)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(PROGMEM2CHAR(VALUE_60), stmp.c_str(),PROGMEM2CHAR(VALUE_60))
  
  SELECT_END
  if(msg_alert_error) 
	{
		MSG_ERROR(smsg.c_str()) 
		buffer2send+=(PROGMEM2CHAR(FORM_SUBMIT)); 
	}
  else if(msg_alert_success) 
		{
			MSG_SUCCESS(smsg.c_str()) 
		}
	else buffer2send+=(PROGMEM2CHAR(FORM_SUBMIT)); 
	
	buffer2send+=(PROGMEM2CHAR(FORM_END));
	buffer2send+=(PROGMEM2CHAR(PANEL_END)); 
  if (msg_alert_success && !msg_alert_error)
	{
		buffer2send+= PROGMEM2CHAR(RESTARTCMD);
	}
	buffer2send+=(PROGMEM2CHAR(PAGE_BOTTOM));
	web_interface->WebServer.send(200, "text/html", buffer2send);
}

void handle_web_interface_configAP()
{
  String stmp,smsg;
  String buffer2send ="";
  char sbuf[MAX_PASSWORD_LENGH+1];
  char error_display[9]={0,0,0,0,0,0,0,0,0};
  char password_buf[MAX_PASSWORD_LENGH+1];
  char ssid_buf[MAX_SSID_LENGH+1];
  char ip_buf[15+1];
  byte ip_sav[4];
  byte gw_sav[4];
  byte msk_sav[4];
  char gw_buf[15+1];
  char msk_buf[15+1];
  byte visible_buf;
  byte static_ip_buf;
  byte auth_buf;
  byte channel_buf;
  byte phy_mode_buf;
  byte bflag=0;
  bool msg_alert_error=false;
  bool msg_alert_success=false;
  //check is it is a submission or a display
  smsg="";
  if (web_interface->WebServer.hasArg(PROGMEM2CHAR(SUBMIT_ID)))
  {   //is there a correct list of values?
	  if (web_interface->WebServer.hasArg(PROGMEM2CHAR(SSID_ID)) && web_interface->WebServer.hasArg(PROGMEM2CHAR(PASSWORD_ID))&& web_interface->WebServer.hasArg(PROGMEM2CHAR(NETWORK_ID))&& web_interface->WebServer.hasArg(PROGMEM2CHAR(AUTENTIFICATION_ID))&& web_interface->WebServer.hasArg(PROGMEM2CHAR(IP_NAME))&& web_interface->WebServer.hasArg(PROGMEM2CHAR(GATEWAY_ID))&& web_interface->WebServer.hasArg(PROGMEM2CHAR(SUBNET_ID))&& web_interface->WebServer.hasArg(PROGMEM2CHAR(CHANNEL_ID)))
		{	//ssid
			if (web_interface->WebServer.arg(PROGMEM2CHAR(SSID_ID)).length() > MAX_SSID_LENGH)
				{
				stmp = 	web_interface->WebServer.arg(PROGMEM2CHAR(SSID_ID)).substring(0,MAX_SSID_LENGH);
				msg_alert_error=true;
				error_display[0]=1;
				smsg+=PROGMEM2CHAR(ERROR_INCORRECT_SSID);
				web_interface->urldecode(ssid_buf,stmp.c_str());
				}
			else
				web_interface->urldecode(ssid_buf,web_interface->WebServer.arg(PROGMEM2CHAR(SSID_ID)).c_str());
			if (!web_interface->isSSIDValid(ssid_buf))
				{
				msg_alert_error=true;
				smsg+=PROGMEM2CHAR(ERROR_INCORRECT_SSID);
				error_display[0]=1;	
				}

			if (web_interface->WebServer.arg(PROGMEM2CHAR(PASSWORD_ID)).length() > MAX_PASSWORD_LENGH)
				{
				stmp = 	web_interface->WebServer.arg(PROGMEM2CHAR(PASSWORD_ID)).substring(0,MAX_PASSWORD_LENGH);
				msg_alert_error=true;
				error_display[0]=2;
				smsg+=PROGMEM2CHAR(ERROR_INCORRECT_PASSWORD);
				web_interface->urldecode(password_buf,stmp.c_str());
				}
			else
				web_interface->urldecode(password_buf,web_interface->WebServer.arg(PROGMEM2CHAR(PASSWORD_ID)).c_str());
			if (!web_interface->isPasswordValid(password_buf))
				{
				msg_alert_error=true;
				smsg+=PROGMEM2CHAR(ERROR_INCORRECT_PASSWORD);
				error_display[2]=1;	
				}
			//ssid visible ?	
			if (web_interface->WebServer.hasArg(PROGMEM2CHAR(VISIBLE_NAME))) 
				{
					visible_buf=1;
				}
			else
				{
					visible_buf=0;
				}
			//phy mode
			phy_mode_buf  = atoi(web_interface->WebServer.arg(PROGMEM2CHAR(NETWORK_ID)).c_str());
			if (!(phy_mode_buf==PHY_MODE_11B||phy_mode_buf==PHY_MODE_11G) )
				 {
					msg_alert_error=true;
					smsg+=PROGMEM2CHAR(ERROR_QUERY);
				 }
			//channel
			channel_buf  = atoi(web_interface->WebServer.arg(PROGMEM2CHAR(CHANNEL_ID)).c_str());
			if (channel_buf< 1|| channel_buf>11) 
				 {
					msg_alert_error=true;
					smsg+=PROGMEM2CHAR(ERROR_QUERY);
				 }
			//authentification
			auth_buf  = atoi(web_interface->WebServer.arg(PROGMEM2CHAR(AUTENTIFICATION_ID)).c_str());
			if (!(auth_buf==AUTH_OPEN||auth_buf==AUTH_WEP||auth_buf==AUTH_WPA_PSK||auth_buf==AUTH_WPA2_PSK||auth_buf==AUTH_WPA_WPA2_PSK||auth_buf==AUTH_MAX) )
				 {
					msg_alert_error=true;
					smsg+=PROGMEM2CHAR(ERROR_QUERY);
				 }	
		    //Static IP ?	
			if (web_interface->WebServer.hasArg(PROGMEM2CHAR(STATIC_IP_NAME))) 
				{
					static_ip_buf=STATIC_IP_MODE;
				}
			else
				{
					static_ip_buf=DHCP_MODE;
				}
				
			//IP
			if (web_interface->WebServer.arg(PROGMEM2CHAR(IP_NAME)).length() > MAX_SSID_LENGH)
				{
				stmp = 	web_interface->WebServer.arg(PROGMEM2CHAR(IP_NAME)).substring(0,MAX_SSID_LENGH);
				msg_alert_error=true;
				error_display[6]=1;
				smsg+=PROGMEM2CHAR(ERROR_INCORRECT_IP_FORMAT);
				web_interface->urldecode(ip_buf,stmp.c_str());
				}
			else
				web_interface->urldecode(ip_buf,web_interface->WebServer.arg(PROGMEM2CHAR(IP_NAME)).c_str());
			if (!web_interface->isIPValid(ip_buf))
				{
				msg_alert_error=true;
				smsg+=PROGMEM2CHAR(ERROR_INCORRECT_IP_FORMAT);
				error_display[6]=1;	
				}
				
			//Gateway
			if (web_interface->WebServer.arg(PROGMEM2CHAR(GATEWAY_ID)).length() > MAX_SSID_LENGH)
				{
				stmp = 	web_interface->WebServer.arg(PROGMEM2CHAR(GATEWAY_ID)).substring(0,MAX_SSID_LENGH);
				msg_alert_error=true;
				error_display[7]=1;
				smsg+=PROGMEM2CHAR(ERROR_INCORRECT_IP_FORMAT);
				web_interface->urldecode(gw_buf,stmp.c_str());
				}
			else
				web_interface->urldecode(gw_buf,web_interface->WebServer.arg(PROGMEM2CHAR(GATEWAY_ID)).c_str());
			if (!web_interface->isIPValid(gw_buf))
				{
				msg_alert_error=true;
				smsg+=PROGMEM2CHAR(ERROR_INCORRECT_IP_FORMAT);
				error_display[7]=1;	
				}
			//subnet
			if (web_interface->WebServer.arg(PROGMEM2CHAR(SUBNET_ID)).length() > MAX_SSID_LENGH)
				{
				stmp = 	web_interface->WebServer.arg(PROGMEM2CHAR(SUBNET_ID)).substring(0,MAX_SSID_LENGH);
				msg_alert_error=true;
				error_display[8]=1;
				smsg+=PROGMEM2CHAR(ERROR_INCORRECT_IP_FORMAT);
				web_interface->urldecode(msk_buf,stmp.c_str());
				}
			else
				web_interface->urldecode(msk_buf,web_interface->WebServer.arg(PROGMEM2CHAR(SUBNET_ID)).c_str());
			if (!web_interface->isIPValid(msk_buf))
				{
				msg_alert_error=true;
				smsg+=PROGMEM2CHAR(ERROR_INCORRECT_IP_FORMAT);
				error_display[8]=1;	
				}	 	    	  	    
		}
      else
	   {
		msg_alert_error=true;
		smsg=PROGMEM2CHAR(ERROR_QUERY);
	   }
	   
	   
	   //no error ? then save
	   if (msg_alert_error==false)
		{
		//save
		 char ip_buftmp[15+1];
		 strcpy(ip_buftmp,ip_buf);
		 wifi_config.split_ip(ip_buftmp,ip_sav);
		 strcpy(ip_buftmp,gw_buf);
		 wifi_config.split_ip(ip_buftmp,gw_sav);
		 strcpy(ip_buftmp,msk_buf);
		 wifi_config.split_ip(ip_buftmp,msk_sav);
		 if((!CONFIG::write_byte(EP_WIFI_MODE,AP_MODE))||
			(!CONFIG::write_string(EP_SSID,ssid_buf,strlen(ssid_buf)))||
			(!CONFIG::write_string(EP_PASSWORD,password_buf,strlen(password_buf)))||
			(!CONFIG::write_byte(EP_SSID_VISIBLE,visible_buf))||
			(!CONFIG::write_byte(EP_PHY_MODE,phy_mode_buf))||
			(!CONFIG::write_byte(EP_CHANNEL,channel_buf)) ||
			(!CONFIG::write_byte(EP_AUTH_TYPE,auth_buf)) ||
			(!CONFIG::write_byte(EP_IP_MODE,static_ip_buf)) ||
			(!CONFIG::write_buffer(EP_IP_VALUE,ip_sav,IP_LENGH))||
			(!CONFIG::write_buffer(EP_GATEWAY_VALUE,gw_sav,IP_LENGH))||
			(!CONFIG::write_buffer(EP_MASK_VALUE,msk_sav,IP_LENGH)))msg_alert_error=true;
		
