luc-github/ESP3D/esp8266/webinterface.cpp
		if (msg_alert_error)smsg=PROGMEM2CHAR(ERROR_WRITING_CHANGES);
		if (!msg_alert_error)
			{
				msg_alert_success=true;
				smsg=PROGMEM2CHAR(SAVED_CHANGES);
				
			}
		}
	   
	}
	else
	{
	//ssid
	if (!CONFIG::read_string(EP_SSID, ssid_buf , MAX_SSID_LENGH) )strcpy(ssid_buf,PROGMEM2CHAR(DEFAULT_SSID));
	//password 
	if (!CONFIG::read_string(EP_PASSWORD, password_buf , MAX_PASSWORD_LENGH) )strcpy(password_buf,PROGMEM2CHAR(DEFAULT_PASSWORD));
	//ssid visible ?
	if (!CONFIG::read_byte(EP_SSID_VISIBLE, &visible_buf ))visible_buf=DEFAULT_SSID_VISIBLE;
	//phy mode
	if (!CONFIG::read_byte(EP_PHY_MODE, &phy_mode_buf ))phy_mode_buf=DEFAULT_PHY_MODE;
	//authentification
	if (!CONFIG::read_byte(EP_AUTH_TYPE, &auth_buf ))auth_buf=DEFAULT_AUTH_TYPE;
	//channel
	if (!CONFIG::read_byte(EP_CHANNEL, &channel_buf ))channel_buf=DEFAULT_CHANNEL;
	//static IP ?
	if (!CONFIG::read_byte(EP_IP_MODE, &static_ip_buf ))static_ip_buf=DEFAULT_IP_MODE;
	//IP for static IP
	if (!CONFIG::read_buffer(EP_IP_VALUE,(byte *)sbuf , IP_LENGH) )
		strcpy(ip_buf,wifi_config.ip2str((byte *)DEFAULT_IP_VALUE));
	else
		strcpy(ip_buf,wifi_config.ip2str((byte *)sbuf));  
	//GW for static IP
	if (!CONFIG::read_buffer(EP_GATEWAY_VALUE,(byte *)sbuf , IP_LENGH) )
		strcpy(gw_buf,wifi_config.ip2str((byte *)DEFAULT_GATEWAY_VALUE));
	else
		strcpy(gw_buf,wifi_config.ip2str((byte *)sbuf));  
	
	//Subnet for static IP
	if (!CONFIG::read_buffer(EP_MASK_VALUE,(byte *)sbuf , IP_LENGH) )
		strcpy(msk_buf,wifi_config.ip2str((byte *)DEFAULT_MASK_VALUE));
	else
		strcpy(msk_buf,wifi_config.ip2str((byte *)sbuf));  
	}
  
  //display page
  if (wifi_get_opmode()==WIFI_STA ) stmp=wifi_config.ip2str(WiFi.localIP());
  else stmp=wifi_config.ip2str(WiFi.softAPIP());
  if (wifi_config.iweb_port!=80)
	{
		stmp+=":";
		stmp+=String(wifi_config.iweb_port);
	}
  buffer2send+=(PROGMEM2CHAR(PAGE_HEAD_1));
  add_css (buffer2send);
  buffer2send+=(PROGMEM2CHAR(PAGE_HEAD_2));
  TOPBAR(stmp.c_str(),3)
  buffer2send+=(PROGMEM2CHAR(PANEL_TOP));
  buffer2send+=(PROGMEM2CHAR(ACCESS_POINT_TITLE));
  buffer2send+=(PROGMEM2CHAR(PANEL_START));
  buffer2send+=(PROGMEM2CHAR(FORM_START));
  //ssid
   if(error_display[0]==0)
    {
		INPUT_TEXT( PROGMEM2CHAR(AP_1_ID),PROGMEM2CHAR(SSID_TITLE), PROGMEM2CHAR(SSID_ID),PROGMEM2CHAR(SSID_ID),ssid_buf)
	}
    else
    {
		INPUT_TEXT_ERROR( PROGMEM2CHAR(AP_1_ID),PROGMEM2CHAR(SSID_TITLE), PROGMEM2CHAR(SSID_ID),PROGMEM2CHAR(SSID_ID),ssid_buf)
	}
  //password 
   if(error_display[1]==0)
    {
		INPUT_PASSWORD( PROGMEM2CHAR(AP_2_ID),PROGMEM2CHAR(PASSWORD_TITLE), PROGMEM2CHAR(PASSWORD_ID),PROGMEM2CHAR(PASSWORD_NAME),password_buf)
	}
   else
    {
		INPUT_PASSWORD_ERROR( PROGMEM2CHAR(AP_2_ID),PROGMEM2CHAR(PASSWORD_TITLE), PROGMEM2CHAR(PASSWORD_ID),PROGMEM2CHAR(PASSWORD_NAME),password_buf)
	}
  //ssid visible ?
  if (visible_buf==1)stmp=PROGMEM2CHAR(CHECKED_VALUE);
  else stmp="";
  INPUT_CHECKBOX( PROGMEM2CHAR(VISIBLE_NAME),PROGMEM2CHAR(VISIBLE_LABEL),stmp.c_str())
  //Phy mode
  SELECT_START(PROGMEM2CHAR(AP_4_ID),PROGMEM2CHAR(NETWORK_TITLE),PROGMEM2CHAR(NETWORK_ID))
  if (phy_mode_buf==PHY_MODE_11B)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(PHY_MODE_11B).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_11B))
  if (phy_mode_buf==PHY_MODE_11G)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(PHY_MODE_11G).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_11G))
  SELECT_END

  //CHANNEL
  SELECT_START(PROGMEM2CHAR(AP_10_ID),PROGMEM2CHAR(CHANNEL_TITLE),PROGMEM2CHAR(CHANNEL_ID))
  for (int c=1;c < 12;c++)
	{
	if (channel_buf==c)stmp = PROGMEM2CHAR(VALUE_SELECTED);
	else stmp="";
	OPTION(String(c).c_str(), stmp.c_str(),String(c).c_str())
	}
  SELECT_END
	
  //Authentification
  SELECT_START(PROGMEM2CHAR(AP_5_ID),PROGMEM2CHAR(AUTENTIFICATION_TITLE),PROGMEM2CHAR(AUTENTIFICATION_ID))
  if (auth_buf==AUTH_OPEN)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(AUTH_OPEN).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_NONE))
  if (auth_buf==AUTH_WEP)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(AUTH_WEP).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_WEP))
  if (auth_buf==AUTH_WPA_PSK)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(AUTH_WPA_PSK).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_WPA))
  if (auth_buf==AUTH_WPA2_PSK)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(AUTH_WPA2_PSK).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_WPA2))
  if (auth_buf==AUTH_WPA_WPA2_PSK)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(AUTH_WPA_WPA2_PSK).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_WPAWPA2))
  if (auth_buf==AUTH_MAX)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(AUTH_MAX).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_MAX))
  SELECT_END
  //static IP ?
  if (static_ip_buf==STATIC_IP_MODE)stmp=PROGMEM2CHAR(CHECKED_VALUE);
  else stmp="";
  INPUT_CHECKBOX(PROGMEM2CHAR(STATIC_IP_NAME), PROGMEM2CHAR(STATIC_IP_LABEL),stmp.c_str())
  // if (static_ip_buf==STATIC_IP_MODE)buffer2send+=(PROGMEM2CHAR(SHOW_IP_BLOCK));
  //else buffer2send+=(PROGMEM2CHAR(HIDE_IP_BLOCK));
  //IP for static IP
   if(error_display[6]==0)
    {
		INPUT_TEXT( PROGMEM2CHAR(AP_7_ID),PROGMEM2CHAR(IP_TITLE), PROGMEM2CHAR(IP_NAME),PROGMEM2CHAR(IP_NAME),ip_buf)
	}
   else
	{
		INPUT_TEXT_ERROR( PROGMEM2CHAR(AP_7_ID),PROGMEM2CHAR(IP_TITLE), PROGMEM2CHAR(IP_NAME),PROGMEM2CHAR(IP_NAME),ip_buf)
	}
 //Gateway for static IP
   if(error_display[7]==0)
    {
		INPUT_TEXT( PROGMEM2CHAR(AP_8_ID),PROGMEM2CHAR(GATEWAY_TITLE), PROGMEM2CHAR(GATEWAY_ID),PROGMEM2CHAR(GATEWAY_NAME),gw_buf)
	}
   else
    {
		INPUT_TEXT_ERROR( PROGMEM2CHAR(AP_8_ID),PROGMEM2CHAR(GATEWAY_TITLE), PROGMEM2CHAR(GATEWAY_ID),PROGMEM2CHAR(GATEWAY_NAME),gw_buf)
	}
  //Mask for static IP
   if(error_display[8]==0)
    {
	INPUT_TEXT( PROGMEM2CHAR(AP_9_ID),PROGMEM2CHAR(SUBNET_TITLE), PROGMEM2CHAR(SUBNET_ID),PROGMEM2CHAR(SUBNET_NAME),msk_buf)
	}
   else
    {
	INPUT_TEXT_ERROR( PROGMEM2CHAR(AP_9_ID),PROGMEM2CHAR(SUBNET_TITLE), PROGMEM2CHAR(SUBNET_ID),PROGMEM2CHAR(SUBNET_NAME),msk_buf)
	}
	//buffer2send+=(PROGMEM2CHAR(DIV_E));

  
  if(msg_alert_error) 
	{
		MSG_ERROR(smsg.c_str()) 
		buffer2send+=(PROGMEM2CHAR(FORM_SUBMIT)); 
	}
  else if(msg_alert_success) 
		{
			MSG_SUCCESS(smsg.c_str()) 
		}
	else buffer2send+=(PROGMEM2CHAR(FORM_SUBMIT)); 
		
  
	buffer2send+=(PROGMEM2CHAR(FORM_END));
	buffer2send+=(PROGMEM2CHAR(PANEL_END)); 
	if (msg_alert_success && !msg_alert_error)
	{
		buffer2send+=PROGMEM2CHAR(RESTARTCMD);
	}
	buffer2send+=(PROGMEM2CHAR(PAGE_BOTTOM));
	web_interface->WebServer.send(200, "text/html", buffer2send);
}


