luc-github/ESP3D/esp8266/webinterface.cpp
void handle_web_interface_configSTA()
{
  String stmp,smsg;
  String buffer2send ="";
  char sbuf[MAX_PASSWORD_LENGH+1];
  char error_display[9]={0,0,0,0,0,0,0,0,0};
  char password_buf[MAX_PASSWORD_LENGH+1];
  char ssid_buf[MAX_SSID_LENGH+1];
  char ip_buf[15+1];
  byte ip_sav[4];
  byte gw_sav[4];
  byte msk_sav[4];
  char gw_buf[15+1];
  char msk_buf[15+1];
  byte visible_buf;
  byte static_ip_buf;
  byte auth_buf;
  byte channel_buf;
  byte phy_mode_buf;
  byte bflag=0;
  bool revertSTA=false;
  bool msg_alert_error=false;
  bool msg_alert_success=false;
  //check is it is a submission or a display
  smsg="";
  if (web_interface->WebServer.hasArg(PROGMEM2CHAR(SUBMIT_ID)))
  {   //is there a correct list of values?
	  if (web_interface->WebServer.hasArg(PROGMEM2CHAR(SSID_ID)) && web_interface->WebServer.hasArg(PROGMEM2CHAR(PASSWORD_ID))&& web_interface->WebServer.hasArg(PROGMEM2CHAR(NETWORK_ID))&& web_interface->WebServer.hasArg(PROGMEM2CHAR(IP_NAME))&& web_interface->WebServer.hasArg(PROGMEM2CHAR(GATEWAY_ID))&& web_interface->WebServer.hasArg(PROGMEM2CHAR(SUBNET_ID)))
		{	//ssid
			if (web_interface->WebServer.arg(PROGMEM2CHAR(SSID_ID)).length() > MAX_SSID_LENGH)
				{
				stmp = 	web_interface->WebServer.arg(PROGMEM2CHAR(SSID_ID)).substring(0,MAX_SSID_LENGH);
				msg_alert_error=true;
				error_display[0]=1;
				smsg+=PROGMEM2CHAR(ERROR_INCORRECT_SSID);
				web_interface->urldecode(ssid_buf,stmp.c_str());
				}
			else
				web_interface->urldecode(ssid_buf,web_interface->WebServer.arg(PROGMEM2CHAR(SSID_ID)).c_str());
			if (!web_interface->isSSIDValid(ssid_buf))
				{
				msg_alert_error=true;
				smsg+=PROGMEM2CHAR(ERROR_INCORRECT_SSID);
				error_display[0]=1;	
				}

			if (web_interface->WebServer.arg(PROGMEM2CHAR(PASSWORD_ID)).length() > MAX_PASSWORD_LENGH)
				{
				stmp = 	web_interface->WebServer.arg(PROGMEM2CHAR(PASSWORD_ID)).substring(0,MAX_PASSWORD_LENGH);
				msg_alert_error=true;
				error_display[0]=2;
				smsg+=PROGMEM2CHAR(ERROR_INCORRECT_PASSWORD);
				web_interface->urldecode(password_buf,stmp.c_str());
				}
			else
				web_interface->urldecode(password_buf,web_interface->WebServer.arg(PROGMEM2CHAR(PASSWORD_ID)).c_str());
			if (!web_interface->isPasswordValid(password_buf))
				{
				msg_alert_error=true;
				smsg+=PROGMEM2CHAR(ERROR_INCORRECT_PASSWORD);
				error_display[2]=1;	
				}
			//phy modeString stmp,smsg;
			phy_mode_buf  = atoi(web_interface->WebServer.arg(PROGMEM2CHAR(NETWORK_ID)).c_str());
			if (!(phy_mode_buf==PHY_MODE_11B||phy_mode_buf==PHY_MODE_11G  ||phy_mode_buf==PHY_MODE_11N))
				 {
					msg_alert_error=true;
					smsg+=PROGMEM2CHAR(ERROR_QUERY);
				 }
		    //Static IP ?	
			if (web_interface->WebServer.hasArg(PROGMEM2CHAR(STATIC_IP_NAME))) 
				{
					static_ip_buf=STATIC_IP_MODE;
				}
			else
				{
					static_ip_buf=DHCP_MODE;
				}
				
			//IP
			if (web_interface->WebServer.arg(PROGMEM2CHAR(IP_NAME)).length() > MAX_SSID_LENGH)
				{
				stmp = 	web_interface->WebServer.arg(PROGMEM2CHAR(IP_NAME)).substring(0,MAX_SSID_LENGH);
				msg_alert_error=true;
				error_display[6]=1;
				smsg+=PROGMEM2CHAR(ERROR_INCORRECT_IP_FORMAT);
				web_interface->urldecode(ip_buf,stmp.c_str());
				}
			else
				web_interface->urldecode(ip_buf,web_interface->WebServer.arg(PROGMEM2CHAR(IP_NAME)).c_str());
			if (!web_interface->isIPValid(ip_buf))
				{
				msg_alert_error=true;
				smsg+=PROGMEM2CHAR(ERROR_INCORRECT_IP_FORMAT);
				error_display[6]=1;	
				}
				
			//Gateway
			if (web_interface->WebServer.arg(PROGMEM2CHAR(GATEWAY_ID)).length() > MAX_SSID_LENGH)
				{
				stmp = 	web_interface->WebServer.arg(PROGMEM2CHAR(GATEWAY_ID)).substring(0,MAX_SSID_LENGH);
				msg_alert_error=true;
				error_display[7]=1;
				smsg+=PROGMEM2CHAR(ERROR_INCORRECT_IP_FORMAT);
				web_interface->urldecode(gw_buf,stmp.c_str());
				}
			else
				web_interface->urldecode(gw_buf,web_interface->WebServer.arg(PROGMEM2CHAR(GATEWAY_ID)).c_str());
			if (!web_interface->isIPValid(gw_buf))
				{
				msg_alert_error=true;
				smsg+=PROGMEM2CHAR(ERROR_INCORRECT_IP_FORMAT);
				error_display[7]=1;	
				}
			//subnet
			if (web_interface->WebServer.arg(PROGMEM2CHAR(SUBNET_ID)).length() > MAX_SSID_LENGH)
				{
				stmp = 	web_interface->WebServer.arg(PROGMEM2CHAR(SUBNET_ID)).substring(0,MAX_SSID_LENGH);
				msg_alert_error=true;
				error_display[8]=1;
				smsg+=PROGMEM2CHAR(ERROR_INCORRECT_IP_FORMAT);
				web_interface->urldecode(msk_buf,stmp.c_str());
				}
			else
				web_interface->urldecode(msk_buf,web_interface->WebServer.arg(PROGMEM2CHAR(SUBNET_ID)).c_str());
			if (!web_interface->isIPValid(msk_buf))
				{
				msg_alert_error=true;
				smsg+=PROGMEM2CHAR(ERROR_INCORRECT_IP_FORMAT);
				error_display[8]=1;	
				}	 	    	  	    
		}
      else
	   {
		msg_alert_error=true;
		smsg=PROGMEM2CHAR(ERROR_QUERY);
	   }
	   
	   
	   //no error ? then save
	   if (msg_alert_error==false)
		{
		//save
		 char ip_buftmp[15+1];
		 strcpy(ip_buftmp,ip_buf);
		 wifi_config.split_ip(ip_buftmp,ip_sav);
		 strcpy(ip_buftmp,gw_buf);
		 wifi_config.split_ip(ip_buftmp,gw_sav);
		 strcpy(ip_buftmp,msk_buf);
		 wifi_config.split_ip(ip_buftmp,msk_sav);
		 if((!CONFIG::write_byte(EP_WIFI_MODE,CLIENT_MODE))||
			(!CONFIG::write_string(EP_SSID,ssid_buf,strlen(ssid_buf)))||
			(!CONFIG::write_string(EP_PASSWORD,password_buf,strlen(password_buf)))||
			(!CONFIG::write_byte(EP_PHY_MODE,phy_mode_buf))||
			(!CONFIG::write_byte(EP_IP_MODE,static_ip_buf)) ||
			(!CONFIG::write_buffer(EP_IP_VALUE,ip_sav,IP_LENGH))||
			(!CONFIG::write_buffer(EP_GATEWAY_VALUE,gw_sav,IP_LENGH))||
			(!CONFIG::write_buffer(EP_MASK_VALUE,msk_sav,IP_LENGH)))msg_alert_error=true;
		
		if (msg_alert_error)smsg=PROGMEM2CHAR(ERROR_WRITING_CHANGES);
		if (!msg_alert_error)
			{
				msg_alert_success=true;
				smsg=PROGMEM2CHAR(SAVED_CHANGES);
				
			}
		}
	   
	}
	else
	{
	//ssid
	if (!CONFIG::read_string(EP_SSID, ssid_buf , MAX_SSID_LENGH) )strcpy(ssid_buf,PROGMEM2CHAR(DEFAULT_SSID));
	//password 
	if (!CONFIG::read_string(EP_PASSWORD, password_buf , MAX_PASSWORD_LENGH) )strcpy(password_buf,PROGMEM2CHAR(DEFAULT_PASSWORD));
	//phy mode
	if (!CONFIG::read_byte(EP_PHY_MODE, &phy_mode_buf ))phy_mode_buf=DEFAULT_PHY_MODE;
	//static IP ?
	if (!CONFIG::read_byte(EP_IP_MODE, &static_ip_buf ))static_ip_buf=DEFAULT_IP_MODE;
	//IP for static IP
	if (!CONFIG::read_buffer(EP_IP_VALUE,(byte *)sbuf , IP_LENGH) )
		strcpy(ip_buf,wifi_config.ip2str((byte *)DEFAULT_IP_VALUE));
	else
		strcpy(ip_buf,wifi_config.ip2str((byte *)sbuf));  
	//GW for static IP
	if (!CONFIG::read_buffer(EP_GATEWAY_VALUE,(byte *)sbuf , IP_LENGH) )
		strcpy(gw_buf,wifi_config.ip2str((byte *)DEFAULT_GATEWAY_VALUE));
	else
		strcpy(gw_buf,wifi_config.ip2str((byte *)sbuf));  
	
