luc-github/ESP3D/esp8266/webinterface.cpp
	//Subnet for static IP
	if (!CONFIG::read_buffer(EP_MASK_VALUE,(byte *)sbuf , IP_LENGH) )
		strcpy(msk_buf,wifi_config.ip2str((byte *)DEFAULT_MASK_VALUE));
	else
		strcpy(msk_buf,wifi_config.ip2str((byte *)sbuf));  
	}
  
  
  //display page
  if (wifi_get_opmode()==WIFI_STA ) stmp=wifi_config.ip2str(WiFi.localIP());
  else stmp=wifi_config.ip2str(WiFi.softAPIP());
  if (wifi_config.iweb_port!=80)
	{
		stmp+=":";
		stmp+=String(wifi_config.iweb_port);
	}
  buffer2send+=(PROGMEM2CHAR(PAGE_HEAD_1));
  add_css (buffer2send);
  buffer2send+=(PROGMEM2CHAR(PAGE_HEAD_2));
  TOPBAR(stmp.c_str(),4)
  buffer2send+=(PROGMEM2CHAR(PANEL_TOP));
  buffer2send+=(PROGMEM2CHAR(STATION_TITLE));
  buffer2send+=(PROGMEM2CHAR(PANEL_START));
  buffer2send+=(PROGMEM2CHAR(FORM_START));
  
   //if in AP mode switch to mixed mode to be able to scan
  if (wifi_get_opmode()!=WIFI_STA )
	{
		WiFi.mode(WIFI_AP_STA);
		revertSTA=true;
	}
	
  int n = WiFi.scanNetworks();
  buffer2send+=(PROGMEM2CHAR(TABLE_START));
  buffer2send+=(PROGMEM2CHAR(CAPTION_S));
  buffer2send+=(String(n).c_str());
  buffer2send+=(PROGMEM2CHAR(AVAILABLE_APS));
  buffer2send+=(PROGMEM2CHAR(CAPTION_E));
  buffer2send+=(PROGMEM2CHAR(THEAD_S));
  buffer2send+=(PROGMEM2CHAR(TR_S));
  TH_ENTRY(PROGMEM2CHAR(NUMBER_LABEL))
  TH_ENTRY(PROGMEM2CHAR(SSID_ID))
  TH_ENTRY(PROGMEM2CHAR(RSSI_NAME))
  TH_ENTRY(PROGMEM2CHAR(PROTECTED_NAME))
  buffer2send+=(PROGMEM2CHAR(TR_E));
  buffer2send+=(PROGMEM2CHAR(THEAD_E));
  buffer2send+=(PROGMEM2CHAR(TBODY_S));
  for (int i = 0; i < n; ++i)
    {
      // Print SSID and RSSI for each network found
      buffer2send+=(PROGMEM2CHAR(TR_S));
	  THR_ENTRY(String(i+1).c_str())
	  TD_ENTRY(WiFi.SSID(i))
	  stmp = String(100+WiFi.RSSI(i)) + "%";
	  TD_ENTRY(stmp.c_str())
	  TD_ENTRY((WiFi.encryptionType(i) == ENC_TYPE_NONE)?PROGMEM2CHAR(VALUE_NO):PROGMEM2CHAR(VALUE_YES))
    }
   //close table
   buffer2send+=(PROGMEM2CHAR(TABLE_END));
  
 
  //revert to pure softAP
   if (revertSTA) WiFi.mode(WIFI_AP);
    //ssid
   if(error_display[0]==0)
    {
		INPUT_TEXT( PROGMEM2CHAR(AP_1_ID),PROGMEM2CHAR(SSID_TITLE), PROGMEM2CHAR(SSID_ID),PROGMEM2CHAR(SSID_ID),ssid_buf)
	}
    else
    {
		INPUT_TEXT_ERROR( PROGMEM2CHAR(AP_1_ID),PROGMEM2CHAR(SSID_TITLE), PROGMEM2CHAR(SSID_ID),PROGMEM2CHAR(SSID_ID),ssid_buf)
	}
  //password 
   if(error_display[1]==0)
    {
		INPUT_PASSWORD( PROGMEM2CHAR(AP_2_ID),PROGMEM2CHAR(PASSWORD_TITLE), PROGMEM2CHAR(PASSWORD_ID),PROGMEM2CHAR(PASSWORD_NAME),password_buf)
	}
   else
    {
		INPUT_PASSWORD_ERROR( PROGMEM2CHAR(AP_2_ID),PROGMEM2CHAR(PASSWORD_TITLE), PROGMEM2CHAR(PASSWORD_ID),PROGMEM2CHAR(PASSWORD_NAME),password_buf)
	}
  //Phy mode
  SELECT_START(PROGMEM2CHAR(AP_4_ID),PROGMEM2CHAR(NETWORK_TITLE),PROGMEM2CHAR(NETWORK_ID))
  if (phy_mode_buf==PHY_MODE_11B)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(PHY_MODE_11B).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_11B))
  if (phy_mode_buf==PHY_MODE_11G)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(PHY_MODE_11G).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_11G))
  if (phy_mode_buf==PHY_MODE_11N)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(PHY_MODE_11N).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_11N))
  SELECT_END
  //static IP ?
  if (static_ip_buf==STATIC_IP_MODE)stmp=PROGMEM2CHAR(CHECKED_VALUE);
  else stmp="";
  INPUT_CHECKBOX(PROGMEM2CHAR(STATIC_IP_NAME), PROGMEM2CHAR(STATIC_IP_LABEL),stmp.c_str())
  // if (static_ip_buf==STATIC_IP_MODE)buffer2send+=(PROGMEM2CHAR(SHOW_IP_BLOCK));
  //else buffer2send+=(PROGMEM2CHAR(HIDE_IP_BLOCK));
  //IP for static IP
   if(error_display[6]==0)
    {
		INPUT_TEXT( PROGMEM2CHAR(AP_7_ID),PROGMEM2CHAR(IP_TITLE), PROGMEM2CHAR(IP_NAME),PROGMEM2CHAR(IP_NAME),ip_buf)
	}
   else
	{
		INPUT_TEXT_ERROR( PROGMEM2CHAR(AP_7_ID),PROGMEM2CHAR(IP_TITLE), PROGMEM2CHAR(IP_NAME),PROGMEM2CHAR(IP_NAME),ip_buf)
	}
 //Gateway for static IP
   if(error_display[7]==0)
    {
		INPUT_TEXT( PROGMEM2CHAR(AP_8_ID),PROGMEM2CHAR(GATEWAY_TITLE), PROGMEM2CHAR(GATEWAY_ID),PROGMEM2CHAR(GATEWAY_NAME),gw_buf)
	}
   else
    {
		INPUT_TEXT_ERROR( PROGMEM2CHAR(AP_8_ID),PROGMEM2CHAR(GATEWAY_TITLE), PROGMEM2CHAR(GATEWAY_ID),PROGMEM2CHAR(GATEWAY_NAME),gw_buf)
	}
  //Mask for static IP
   if(error_display[8]==0)
    {
	INPUT_TEXT( PROGMEM2CHAR(AP_9_ID),PROGMEM2CHAR(SUBNET_TITLE), PROGMEM2CHAR(SUBNET_ID),PROGMEM2CHAR(SUBNET_NAME),msk_buf)
	}
   else
    {
	INPUT_TEXT_ERROR( PROGMEM2CHAR(AP_9_ID),PROGMEM2CHAR(SUBNET_TITLE), PROGMEM2CHAR(SUBNET_ID),PROGMEM2CHAR(SUBNET_NAME),msk_buf)
	}
	//buffer2send+=(PROGMEM2CHAR(DIV_E));

  
  if(msg_alert_error) 
	{
		MSG_ERROR(smsg.c_str()) 
		buffer2send+=(PROGMEM2CHAR(FORM_SUBMIT)); 
	}
  else if(msg_alert_success) 
		{
			MSG_SUCCESS(smsg.c_str()) 
		}
	else buffer2send+=(PROGMEM2CHAR(FORM_SUBMIT)); 
		
 
	buffer2send+=(PROGMEM2CHAR(FORM_END));
	buffer2send+=(PROGMEM2CHAR(PANEL_END)); 
  if (msg_alert_success && !msg_alert_error)
	{
		buffer2send+= PROGMEM2CHAR(RESTARTCMD);
	}
	buffer2send+=(PROGMEM2CHAR(PAGE_BOTTOM));
	web_interface->WebServer.send(200, "text/html", buffer2send);
}


void handle_not_found()
{
  String IP;
  String buffer2send ="";
  if (wifi_get_opmode()==WIFI_STA ) IP=wifi_config.ip2str(WiFi.localIP());
  else IP=wifi_config.ip2str(WiFi.softAPIP());
  if (wifi_config.iweb_port!=80)
	{
		IP+=":";
		IP+=String(wifi_config.iweb_port);
	}
  buffer2send+=(PROGMEM2CHAR(T404_PAGE));
  buffer2send+=(IP.c_str());
  buffer2send+=(PROGMEM2CHAR(T404_PAGE_2));
  web_interface->WebServer.send(200, "text/html", buffer2send);
}

void handle_web_interface_printer()
{
  String IP;
  String stmp;
  String buffer2send ="";
  byte polling_time = 3;
  if (!CONFIG::read_byte(EP_POLLING_TIME, &polling_time ))polling_time=DEFAULT_POLLING_TIME;
  //Serial.println("M114");
  Serial.println("M220");
  Serial.println("M221");
  //display page
  if (wifi_get_opmode()==WIFI_STA ) stmp=wifi_config.ip2str(WiFi.localIP());
  else stmp=wifi_config.ip2str(WiFi.softAPIP());
  if (wifi_config.iweb_port!=80)
	{
		stmp+=":";
		stmp+=String(wifi_config.iweb_port);
	}
  buffer2send+=(PROGMEM2CHAR(PAGE_HEAD_1));
  add_css (buffer2send);
  buffer2send+=(PROGMEM2CHAR(PAGE_HEAD_2));
  TOPBAR(stmp.c_str(),5)
  buffer2send+=(PROGMEM2CHAR(PRINTER_1a));
  buffer2send+=(PROGMEM2CHAR(PRINTER_1b));
  buffer2send+=(PROGMEM2CHAR(PRINTER_1c));
  buffer2send+=(PROGMEM2CHAR(PRINTER_1d));
  buffer2send+=(PROGMEM2CHAR(PRINTER_1e));
  buffer2send+=(PROGMEM2CHAR(PRINTER_1f));
  buffer2send+=(PROGMEM2CHAR(PRINTER_1g));
  buffer2send+=(PROGMEM2CHAR(PRINTER_1h));
  buffer2send+=(PROGMEM2CHAR(PRINTER_1_a_1));
  buffer2send+=stmp.c_str();
  buffer2send+=(PROGMEM2CHAR(PRINTER_1_a_2));
  buffer2send+=(PROGMEM2CHAR(PRINTER_2));
  buffer2send+=stmp.c_str();
  buffer2send+=(PROGMEM2CHAR(PRINTER_3));
  buffer2send+=(PROGMEM2CHAR(PRINTER_4));
  buffer2send+=(PROGMEM2CHAR(PRINTER_5));
  buffer2send+=(PROGMEM2CHAR(PRINTER_6a));
  buffer2send+=(PROGMEM2CHAR(PRINTER_6b));
  buffer2send+=(PROGMEM2CHAR(PRINTER_6c));
  buffer2send+=(PROGMEM2CHAR(PRINTER_6d));
  buffer2send+=(PROGMEM2CHAR(PRINTER_6e));
  buffer2send+=(PROGMEM2CHAR(PRINTER_6f));
  buffer2send+=(PROGMEM2CHAR(PRINTER_6g));
  buffer2send+=(PROGMEM2CHAR(PRINTER_6h));
  buffer2send+=(PROGMEM2CHAR(PRINTER_7));
  buffer2send+=(PROGMEM2CHAR(PRINTER_8));
  buffer2send+=(PROGMEM2CHAR(PRINTER_9));
  buffer2send+=(PROGMEM2CHAR(PRINTER_10));
  buffer2send+=(PROGMEM2CHAR(PRINTER_11a));
  stmp=String(1000*polling_time);
  buffer2send+=stmp.c_str();
  buffer2send+=(PROGMEM2CHAR(PRINTER_11b));
  buffer2send+=(PROGMEM2CHAR(PRINTER_12));
  buffer2send+=(PROGMEM2CHAR(PAGE_BOTTOM));
  web_interface->WebServer.send(200, "text/html", buffer2send);
}

void handle_web_interface_status()
{
	Serial.println("M114");
	String buffer2send =(PROGMEM2CHAR(DATA_S));
	String description;
	String status_color;
	static bool flashit = true;
	int temperature,target;
	flashit=!flashit;
	//request temperature only if no feedback
	if ((system_get_time()-web_interface->last_temp)>2000000)
		Serial.println("M105");
	if ((system_get_time()-web_interface->last_temp)<3200000)
		{
		if (flashit)status_color="lime";
		else status_color="darkgreen";
		}
	else if ((system_get_time()-web_interface->last_temp)<32000000)
		{
		if (flashit)status_color="#FFFF66";
		else status_color="gold";
		}
	else 
		{
		if (flashit)status_color="red";
		else status_color="darkred";
		}
		
