luc-github/ESP3D/esp8266/webinterface.cpp
	int Tpos = web_interface->answer4M105.indexOf("T:");
	int slashpos = web_interface->answer4M105.indexOf(" /",Tpos);	
	int spacepos = web_interface->answer4M105.indexOf(" ",slashpos+1);
	if(slashpos!=-1 && spacepos!=-1 )
			{
			temperature = (int)atof(web_interface->answer4M105.substring(Tpos+2,slashpos).c_str());
			target = (int)atof(web_interface->answer4M105.substring(slashpos+2,spacepos).c_str());
			Tpos = web_interface->answer4M105.indexOf("T1:");
			if (Tpos>-1) description = "Extruder 1: ";
			else description = "Extruder : ";
			description += String(temperature);
			description += "/";
			if (target >0) description += String(target);
			else description += "off";
			TEMP_SVG(temperature,target,description)
			}
	//check for second extruder
	Tpos = web_interface->answer4M105.indexOf("T1:");
	if (Tpos>-1)
		{
		slashpos = web_interface->answer4M105.indexOf(" /",Tpos);
		spacepos = web_interface->answer4M105.indexOf(" ",slashpos+1);
		if(slashpos!=-1 && spacepos!=-1 )
			{
			temperature = (int)atof(web_interface->answer4M105.substring(Tpos+3,slashpos).c_str());
			target = (int)atof(web_interface->answer4M105.substring(slashpos+2,spacepos).c_str());
			description = "Extruder 2: ";
			description += String(temperature);
			description += "/";
			if (target >0) description += String(target);
			else description += "off";
			buffer2send+=(PROGMEM2CHAR(BR));
			TEMP_SVG(temperature,target,description)
			}
		}
	//check for bed
	Tpos = web_interface->answer4M105.indexOf("B:");
	if (Tpos>-1)
		{
		slashpos = web_interface->answer4M105.indexOf(" /",Tpos);	
		spacepos = web_interface->answer4M105.indexOf(" ",slashpos+1);
		if(slashpos!=-1 && spacepos!=-1 )
			{
			temperature = (int)atof(web_interface->answer4M105.substring(Tpos+2,slashpos).c_str());
			target = (int)atof(web_interface->answer4M105.substring(slashpos+2,spacepos).c_str());
			description = "Bed: ";
			description += String(temperature);
			description += "/";
			if (target >0) description += String(target);
			else description += "off";
			buffer2send+=(PROGMEM2CHAR(BR));
			TEMP_SVG(temperature*2,target*2,description)
			}
		}
	buffer2send+=(PROGMEM2CHAR(DIV_E));
	buffer2send+=(PROGMEM2CHAR(DIV_POSITION));
	int tagpos = web_interface->answer4M114.indexOf("X:");
	int tagpos2 = web_interface->answer4M114.indexOf(" ",tagpos);
	description=web_interface->answer4M114.substring(tagpos+2,tagpos2);
	buffer2send+="<LABEL>X:</LABEL><LABEL class=\"text-info\">";
	buffer2send+=description;
	buffer2send+="</LABEL>&nbsp;&nbsp;<LABEL>Y:</LABEL><LABEL class=\"text-info\">";
	tagpos = web_interface->answer4M114.indexOf("Y:");
	tagpos2 = web_interface->answer4M114.indexOf(" ",tagpos);
	description=web_interface->answer4M114.substring(tagpos+2,tagpos2);
	buffer2send+=description;
	buffer2send+="</LABEL>&nbsp;&nbsp;<LABEL>Z:</LABEL><LABEL class=\"text-info\">";
	tagpos = web_interface->answer4M114.indexOf("Z:");
	tagpos2 = web_interface->answer4M114.indexOf(" ",tagpos);
	description=web_interface->answer4M114.substring(tagpos+2,tagpos2);
	buffer2send+=description;
	buffer2send+="</LABEL>&nbsp;&nbsp;";
	buffer2send+=(PROGMEM2CHAR(DIV_E));
	buffer2send+=(PROGMEM2CHAR(DIV_SPEED));
	buffer2send+=web_interface->answer4M220;
	buffer2send+=(PROGMEM2CHAR(DIV_E));
	buffer2send+=(PROGMEM2CHAR(DIV_FLOW));
	buffer2send+=web_interface->answer4M221;
	buffer2send+=(PROGMEM2CHAR(DIV_E));
	buffer2send+=(PROGMEM2CHAR(DIV_STATUS));
	STATUS_SVG(status_color)
	buffer2send+=(PROGMEM2CHAR(DIV_E));
	int p=1;
	buffer2send+=(PROGMEM2CHAR(DIV_INFOMSG));
	if (web_interface->info_msg.get_used_max_index()>-1)
	for (int i=web_interface->info_msg.get_used_max_index();i>=0;i--)
		{
			buffer2send+=String(p);
			buffer2send+="-";
			p++;
			buffer2send+=web_interface->info_msg.get_index_at(i);
			buffer2send+=(PROGMEM2CHAR(BR));
		}
	buffer2send+=(PROGMEM2CHAR(DIV_E));
	p=1;
	buffer2send+=(PROGMEM2CHAR(DIV_ERRORMSG));
	if (web_interface->error_msg.get_used_max_index()>-1)
	for (int i=web_interface->error_msg.get_used_max_index();i>=0;i--)
		{
			buffer2send+=String(p);
			buffer2send+="-";
			p++;
			buffer2send+=web_interface->error_msg.get_index_at(i);
			buffer2send+=(PROGMEM2CHAR(BR));
		}
	buffer2send+=(PROGMEM2CHAR(DIV_E));
	p=1;
	buffer2send+=(PROGMEM2CHAR(DIV_STATUSMSG));
	if (web_interface->status_msg.get_used_max_index()>-1)
	for (int i=web_interface->status_msg.get_used_max_index();i>=0;i--)
		{	buffer2send+=String(p);
			buffer2send+="-";
			p++;
			buffer2send+=web_interface->status_msg.get_index_at(i);
			buffer2send+=(PROGMEM2CHAR(BR));
		}
	buffer2send+=(PROGMEM2CHAR(DIV_E));
	buffer2send+=(PROGMEM2CHAR(DATA_E));
	web_interface->WebServer.send(200, "text/html", buffer2send);
	
}

void handle_restart()
{
	web_interface->WebServer.send(200,"text/html",PROGMEM2CHAR(RESTARTINGMSG));
    web_interface->restartmodule=true;
}

void handle_web_command()
{
if (web_interface->WebServer.hasArg(PROGMEM2CHAR(COMMAND_ID)))
  {  String cmd = web_interface->WebServer.arg(PROGMEM2CHAR(COMMAND_ID));
	 String param = web_interface->WebServer.arg(PROGMEM2CHAR(PARAM_ID));
	  if (cmd=="M112")
				{	
					Serial.println(cmd.c_str());
				}
  }
}


 #ifdef SSDP_FEATURE
 void handle_SSDP(){
      SSDP.schema(web_interface->WebServer.client());
    }
 #endif

//URI Decoding function 
//no check if dst buffer is big enough to receive string so 
//use same size as src is a recommendation
void WEBINTERFACE_CLASS::urldecode(char *dst, const char *src)
{
  char a, b,c;
  if (dst==NULL) return;
  while (*src) {
    if ((*src == '%') &&
      ((a = src[1]) && (b = src[2])) &&
      (isxdigit(a) && isxdigit(b))) {
      if (a >= 'a')
        a -= 'a'-'A';
      if (a >= 'A')
        a -= ('A' - 10);
      else
        a -= '0';
      if (b >= 'a')
        b -= 'a'-'A';
      if (b >= 'A')
        b -= ('A' - 10);
      else
        b -= '0';
      *dst++ = 16*a+b;
      src+=3;
    } 
    else {
		c = *src++;
		if(c=='+')c=' ';
      *dst++ = c;
    }
  }
  *dst++ = '\0';
}


//constructor
WEBINTERFACE_CLASS::WEBINTERFACE_CLASS (int port):WebServer(port)
{
  //init what will handle "/"
  WebServer.on("/",HTTP_ANY, handle_web_interface_root);
  WebServer.on("/CONFIGSYS",HTTP_ANY, handle_web_interface_configSys);
  WebServer.on("/CONFIGAP",HTTP_ANY, handle_web_interface_configAP);
  WebServer.on("/CONFIGSTA",HTTP_ANY, handle_web_interface_configSTA);
  WebServer.on("/STATUS",HTTP_ANY, handle_web_interface_status);
  WebServer.on("/PRINTER",HTTP_ANY, handle_web_interface_printer);
  WebServer.on("/CMD",HTTP_ANY, handle_web_command);
  WebServer.on("/RESTART",HTTP_GET, handle_restart);
  #ifdef SSDP_FEATURE
  WebServer.on("/description.xml", HTTP_GET, handle_SSDP);
  #endif
  WebServer.onNotFound( handle_not_found);
  answer4M105="T:0 /0 ";
  answer4M114="X:0.0 Y:0.0 Z:0.000";
  answer4M220="100";
  answer4M221="100";
  last_temp=system_get_time();
  restartmodule=false;
}

WEBINTERFACE_CLASS * web_interface;

